[Reference](https://medium.com/@matthew.paz/introduction-to-sql-with-sqlite-f8a4f4f6c161)

In [1]:
#Importing sqlite module
import sqlite3

#Establishing a connection to our database
conn = sqlite3.connect("pet_store.db")

#Allows us to interact with our database
cursor = conn.cursor()

In [2]:
#Creating pets table
cursor.execute("""CREATE TABLE pets (pet_id INTEGER PRIMARY KEY AUTOINCREMENT, 
                name TEXT NOT NULL, species TEXT NOT NULL, gender TEXT NOT NULL, 
                DOB TEXT NOT NULL, price REAL NOT NULL)""")

In [3]:
#Inserting our first record into our table
cursor.execute(""" INSERT INTO pets (name, species, gender, DOB, price)
                VALUES ('Herschie', 'dog', 'M', '01/01/2009', 2500.00)""")


#Save data to database
conn.commit()

In [4]:
#List containing new records to be inserted into our table
pets = [
    ('Patches', 'cat', 'M', '05/20/2021', 500.00),
    ('Pgusley', 'dog', 'M', '07/05/2021', 750.00),
    ('Normie', 'turtle', 'M', '04/23/2020', 250.00),
    ('Lisa', 'cat', 'F', '07/23/2021', 125.00),
    ('Lassie', 'dog', 'F', '09/12/1954', 50.00)
]

#Variable containing insert into statement
sql = 'INSERT INTO pets (name, species, gender, DOB, price) VALUES (?,?,?,?,?)'

#Insert multiple records in a single statement
cursor.executemany(sql, pets)

#Save changes to our database
conn.commit()

#Printing the number of rows added to our table
print(cursor.rowcount, "rows were added to the table")

5 rows were added to the table

In [5]:
#Creating variable containing UPDATE statement
update = """
UPDATE pets
SET name = 'Pugsley'
WHERE pet_id = 3
"""
#Modifying existing row
cursor.execute(update)

#Save changes to our database
conn.commit()

In [6]:
#Creating variable containing DELETE statement
deletion = """
DELETE FROM pets
WHERE pet_id = 6
"""

#Removing exisiting row from table
cursor.execute(deletion)

#Save changes to our database
conn.commit()

In [7]:
#Creating variable containing the select statement
sql = """
SELECT name
FROM pets
"""

#Executing the select statement
cursor.execute(sql)

#Retrieves all of the results from the query
cursor.fetchall()

[('Herschie',), ('Patches',), ('Pugsley',), ('Normie',), ('Lisa',)]

In [8]:
#Variable containing SELECT statement
sql = """
SELECT *
FROM pets
"""

#Executing the SELECT query
cursor.execute(sql)

#Retrieving all of the results from the execute query
cursor.fetchall()

[(1, 'Herschie', 'dog', 'M', '01/01/2009', 2500.0),
 (2, 'Patches', 'cat', 'M', '05/20/2021', 500.0),
 (3, 'Pugsley', 'dog', 'M', '07/05/2021', 750.0),
 (4, 'Normie', 'turtle', 'M', '04/23/2020', 250.0),
 (5, 'Lisa', 'cat', 'F', '07/23/2021', 125.0)]

In [9]:
#Variable containing SELECT statement with filtering
sql = """
SELECT *
FROM pets
WHERE gender <> 'M'
"""

#Executing the SELECT query
cursor.execute(sql)

#Retrieving all of the results from the execute query
cursor.fetchall()

[(5, 'Lisa', 'cat', 'F', '07/23/2021', 125.0)]

In [10]:
#Variable containing SELECT statement with filtering
sql = """
SELECT name, price
FROM pets
WHERE price BETWEEN 200.00 AND 800.00
ORDER BY price ASC
"""

#Executing the SELECT query
cursor.execute(sql)

#Retrieving all of the results
cursor.fetchall()

[('Normie', 250.0), ('Patches', 500.0), ('Pugsley', 750.0)]

In [11]:
#Closing connection to our database
conn.close()